# TABELAS [DF1]

In [1]:
import pandas as pd

data = {
    'Nome': ['Ana', 'Bruno', 'Carlos', 'Diana'],
    'Idade': [28, 34, 45, 22],
    'Cidade': ['São Paulo', 'Rio de Janeiro', 'Belo Horizonte', 'Curitiba']
}

df = pd.DataFrame(data)

df

     Nome  Idade          Cidade
0     Ana     28       São Paulo
1   Bruno     34  Rio de Janeiro
2  Carlos     45  Belo Horizonte
3   Diana     22        Curitiba

# MODELO COM REPETIÇÃO [DF2]

In [203]:
import pandas as pd
import numpy as np

num_rows = 20
num_cols = 5

data2 = {
    'ID': np.arange(1, num_rows + 1),
    'Nome': [f'Nome_{i}' for i in range(1, num_rows +1)],
    'Idade': np.random.randint(18, 70, size=num_rows),
    'Salario': np.random.uniform(2000, 10000, size = num_rows).round(2),
    'Cidade': np.random.choice(['São Paulo', 'Rio de Janeiro', 'Belo Horizonte', 'Curitiba', 'Porto Alegre'], size = num_rows)
}

df2 = pd.DataFrame(data2)

df2

    ID     Nome  Idade  Salario          Cidade
0    1   Nome_1     65  9729.57        Curitiba
1    2   Nome_2     26  7082.04       São Paulo
2    3   Nome_3     32  4976.50  Belo Horizonte
3    4   Nome_4     27  3754.00        Curitiba
4    5   Nome_5     29  3568.36       São Paulo
5    6   Nome_6     52  4323.93    Porto Alegre
6    7   Nome_7     36  8050.68  Belo Horizonte
7    8   Nome_8     35  6916.57  Rio de Janeiro
8    9   Nome_9     47  3724.52    Porto Alegre
9   10  Nome_10     35  5159.92  Belo Horizonte
10  11  Nome_11     63  3279.18    Porto Alegre
11  12  Nome_12     23  2632.65  Rio de Janeiro
12  13  Nome_13     26  7678.07    Porto Alegre
13  14  Nome_14     43  2257.31  Belo Horizonte
14  15  Nome_15     31  4647.35  Rio de Janeiro
15  16  Nome_16     28  7734.35    Porto Alegre
16  17  Nome_17     37  6487.17       São Paulo
17  18  Nome_18     24  5176.70        Curitiba
18  19  Nome_19     19  8226.68    Porto Alegre
19  20  Nome_20     23  8934.28  Belo Horizonte

# FILTRAGEM NA TABELA [DF2]

In [204]:
df_filtrado = df2[df2['Salario'] > 8000]
df_filtrado

    ID     Nome  Idade  Salario          Cidade
0    1   Nome_1     65  9729.57        Curitiba
6    7   Nome_7     36  8050.68  Belo Horizonte
18  19  Nome_19     19  8226.68    Porto Alegre
19  20  Nome_20     23  8934.28  Belo Horizonte

In [206]:
df_filtrado2 = df2[(df2['Salario'] > 5000) & (df2['Cidade'] == 'São Paulo')]
df_filtrado2

    ID     Nome  Idade  Salario     Cidade
1    2   Nome_2     26  7082.04  São Paulo
16  17  Nome_17     37  6487.17  São Paulo

In [208]:
df_filtrado3 = df2[(df2['Salario'] > 8000) | (df2['Cidade'] == 'São Paulo')]
df_filtrado3

    ID     Nome  Idade  Salario          Cidade
0    1   Nome_1     65  9729.57        Curitiba
1    2   Nome_2     26  7082.04       São Paulo
4    5   Nome_5     29  3568.36       São Paulo
6    7   Nome_7     36  8050.68  Belo Horizonte
16  17  Nome_17     37  6487.17       São Paulo
18  19  Nome_19     19  8226.68    Porto Alegre
19  20  Nome_20     23  8934.28  Belo Horizonte

# GERAÇÃO ALEATORIA DE NÚMEROS

In [68]:
# numpy.random.randint(LowNumb, HignNumb, size=Amount)

np.random.randint(1, 10, size=1)

array([8], dtype=int32)

# OPERAÇÕES

In [178]:
# .mean ( MÉDIA )
# .round ( ARREDONDAMENTO)

valores = np.random.randint(1, 70, size=70)
valores

array([48, 28, 51, 55, 46,  4, 43, 28, 61, 16, 47, 31, 19, 29,  1,  2, 12,
       55, 44, 38, 38, 42, 65, 48, 20, 31,  8, 17, 40, 18, 51, 52, 68, 44,
       23, 14, 16, 45, 26, 13, 22, 66, 34, 31, 49,  5, 58,  4, 61, 41, 37,
       60, 31, 16, 58,  4,  5, 67, 55,  1, 15, 35, 11, 44, 42, 49, 40, 48,
       42, 63], dtype=int32)

In [182]:
valores.mean().round(1)

np.float64(34.7)

In [214]:
def elevar_ao_quadrado(x):
    return x ** 2

def elevar_ao_cubo(x):
    return x ** 3